## Kız Başına Veri Analizi Bootcamp
## Ödev 2 - Titanic

In [1]:
import numpy as np
import pandas as pd

In [8]:
df = pd.read_csv("titanic/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.shape

(891, 12)

In [10]:
for col in df.columns:
    print(col)

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [12]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### 1. Kazada ölenlerin yaş ortalamasını bulunuz.

In [13]:
df[df['Survived'] == 0]['Age'].mean()

30.62617924528302

#### 2. Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz.

In [18]:
mean = df[df['Survived'] == 0]['Fare'].mean()
print("Ortalama: " ,mean)
median = df[df['Survived'] == 0]['Fare'].median()
print("Medyan: " ,median)

Ortalama:  22.117886885245902
Medyan:  10.5

#### 3. Kazada ölen erkeklerin yaş ortalamasını bulunuz.

In [23]:
df[ (df['Survived'] == 0) & (df['Sex'] == 'male')]['Age'].mean()

31.618055555555557

##### -- kazada yaşayan erkeklerin yaş ortalaması

In [26]:
df[ (df['Survived'] == 1) & (df['Sex'] == 'male')]['Age'].mean()

27.276021505376345

#### 4. Kazada ölen Kadınların yaş ortalamasını bulunuz.

In [24]:
df[ (df['Survived'] == 0) & (df['Sex'] == 'female') ]['Age'].mean()

25.046875

##### -- kazada yaşayan kadınların yaş ortalaması

In [27]:
df[ (df['Survived'] == 1) & (df['Sex'] == 'female') ]['Age'].mean()

28.84771573604061

#### 5. Kazadan kurtulanların yaş ortalamasını bulunuz.

In [31]:
df[df['Survived'] == 1]['Age'].mean()

28.343689655172415

#### 6. Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [35]:
df[df['Survived'] == 1]['Fare'].mean()

48.39540760233918

##### -- kazada ölenlerin bilet fiyatlarının ortalaması

In [37]:
df[df['Survived'] == 0]['Fare'].mean()

22.117886885245902

#### 7. Kazadan kurtulan toplam kişi sayısını bulunuz.

In [40]:
df['Survived'].sum()

342

In [41]:
len(df[df['Survived'] == 1])

342

#### 8. 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz.

In [43]:
df[df['Age'] < 10]['Fare'].median()

27.0

#### 9. 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)

In [45]:
df.groupby('Pclass')['Fare'].agg(['mean', 'median'])

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

#### 10. Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. (Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.

In [54]:
dead_female_ratio = len(df[ (df['Survived'] == 0) & (df['Sex'] == 'female') ]) / len(df[df['Sex'] == 'female'])
print(dead_female_ratio)

0.25796178343949044

In [55]:
dead_male_ratio = len(df[ (df['Survived'] == 0) & (df['Sex'] == 'male') ]) / len(df[df['Sex'] == 'male'])
print(dead_male_ratio)

0.8110918544194108